package seminar_2;
// Напишите метод, который вернет содержимое текущей папки в виде массива строк. 

import java.io.File;

// Напишите метод, который выведет массив, возвращенный предыдущим методом в файл. 
// Обработайте ошибки с помощью try-catch конструкции. В случае возникновения исключения, оно должно записаться в лог-файл.
// https://metanit.com/java/tutorial/6.11.php

// public class task_5 {
//     public static void main(String[] args) {
    //     // FillFile();
    //     File dir = new File("D:\02_Java\seminar_1");
    //     StringBuilder allFiles = GetFiles(dir);
    //     for (int i = 0; i < allFiles.length(); i++) {
    //         System.out.println(allFiles.toString());
    //     }
    // }

    // public static StringBuilder GetFiles(File dir) {
    //     StringBuilder allFiles = new StringBuilder();
    //     try {
    //         for (File fileEntry : dir.listFiles()) {
    //             allFiles.append(fileEntry.getName());
    //         }
    //     } catch (Exception ex) {
    //         ex.getMessage();
        // }
    //    return allFiles();
//     }
// } 
